app/Controllers/Dashboard.php

    public function getdata(){
        // inisiasi object dari class KecamatanModel
        $kecamatan = new KecamatanModel();
        // mengambil kode_kecamatan yang dikirim oleh AJAX
        $kode_kecamatan = $this->request->getGet('kode_kecamatan');
        // melakukan pencarian ke tabel kecamatan berdasarkan kode kecamatan
        $data = $kecamatan->find($kode_kecamatan);
---
SELECT *
FROM `kecamatan`
WHERE `kecamatan`.`kode_kecamatan` = '3302010'