app/Controllers/Pondok.php

SELECT *
FROM `kecamatan`
---
public function tambah(){
$kecamatan = new KecamatanModel();
$kecamatan = $kecamatan->findAll();

SELECT *
FROM `kecamatan`
---
public function edit($npps){
$kecamatan = new KecamatanModel();
$kecamatan = $kecamatan->findAll();

INSERT INTO `sekolah` (`npps`, `kode_kecamatan`, `nama_pondok`, `alamat_pondok`, `koordinat`) VALUES ('5464326', '3302080', 'Miftahul Falah', 'Jl. KH. Yusuf Tsanawi Desa Buniayu, RT5, RW3, Kode Pos53196', '-7.6231039190548255, 109.4412756258024')
---
public function simpan(){
$sekolah = new PondokModel();
// mengambil data dari masing-masing input pada form tambah
// dan disimpan pada array untuk disimpan ke tabel sekolah
$data_sekolah = [
'npps'=>$this->request->getVar('npps'),
'kode_kecamatan'=>$this->request->getVar('kode_kecamatan'),
'nama_pondok'=>$this->request->getVar('nama_pondok'),
'alamat_pondok'=>$this->request->getVar('alamat_pondok'),
'status'=>$this->request->getVar('status'),
'jenjang_pendidikan'=>$this->request->getVar('jenjang_pendidikan'),
'koordinat'=>$this->request->getVar('koordinat')
];
// menggunakan query builder insert
// untuk menyimpan ke tabel sekolah
$sekolah->insert($data_sekolah);

DELETE FROM `sekolah`
WHERE `npps` IN ('5199797')
---
public function hapus($npps){
$sekolah = new PondokModel();
// menggunakan query builder delete
// untuk menghapus data di tabel sekolah
// sesuai npps
$sekolah->delete(['npps' => $npps]);